[
    {
        "id": 1,
        "title": "FIRST BLOG POST!!!",
        "writer": "chap",
        "date": "2024/4/9",
        "content": "(my first time wrting a blog post sorry if it sucks) Hi guys! this is the first official blog post on the new animation vs fnf website! its pretty awesome<br><br>this website was coded by white ninja its actually awesome be sure to check out everything on this website (maybe theress even secrets ?) dont worry well still be posting teasers on twitter but still be sure to check out this website from time to time<br><br>we made a website because uhhh we wanted to yay and also because its easy to navigate too i guess idk I HATE TWITETWEER<br><br>the purpose of these blog posts is for us to talk about the mod and hows its going think of it as like a mini devlog"
    },
    {
        "id": 2,
        "title": "But I’m TCO week 1",
        "writer": "noogai",
        "date": "2024/4/12",
        "content": "hey guys. im noogai9876, a director of avf, and i do art and a LOT of animation. i’ve been here since before v1 (you might’ve already known this if you looked at credits lol) and it’s been a fun experience watching the mod grow little by little. my junior high years were basically spent in avf, so i hope you guys enjoy what we’ve cooked up for you :333<br><br><br><br>im just gonna copy jacelol’s questions tehe<br><br>Q: What will be in AvFNF Episode 2?<br><br>A: LORE, a whole album of new songs and LOTS of remasters. main week will be fully remastered (except for alan’s iconic desktop), and chosen, vengeance and fallen will be merged into one week (with two new songs; cant wait to see your reactions), as well as the long-anticipated king orange week etc.<br><br><br><br>Q: When do you think the mod is releasing?<br><br>A: NEVER /j<br><br><br><br>Q: What is your favorite song currently?<br><br>A: dreaducation without a doubt (sorry chosen v2)<br><br><br><br>Q: What is your favorite part about development?<br><br>A: animating<br><br><br><br>Q: Will there be anything related to AVA 9+?<br><br>A: TCO WEEK 2?!? /j NEVER<br><br><br><br>Q: will there be hood irony in the mod<br><br>A: dud<br><br>as well as some of my own<br><br>Q: Who’s your favorite AvA character?<br><br>A: TCO week 1<br><br><br><br>Q: Who’s your favorite AvFNF developer?<br><br>A: kayla bc peak musician<br><br><br><br>Q: are you gay<br><br>A: no<br><br>ok byee"
    },
    {
        "id": 3,
        "title": "My Hit AvFNF Blog Post",
        "writer": "jace",
        "date": "2024/4/12",
        "content": "Hey everyone! It’s JaceLOL, one of the directors for the mod! It’s been a hot minute since I was hired and BOYYYY did we get some juicy stuff done, such as this website made by White Ninja (the goat). In this post, I just wanted to answer some questions you guys may have and talk about some of the things that are to be expected with this update, so without further ado, let’s get into it:<br><br><br><br>Q: What will be in AvFNF Episode 2?<br><br>A: I can’t reveal TOO much, however, it has been confirmed that the entire main week is getting remastered and there will be a week dedicated to episodes 25-30 of AVM Season 3 (which is where most of the songs I made will be :3). Other than that, you’ll just have to wait and see :)<br><br><br><br>Q: When do you think the mod is releasing?<br><br>A: If I had to guess personally, I'd say sometime around late 2025. We have a lot of stuff planned!<br><br><br><br>Q: What is your favorite song currently?<br><br>A: Definitely Chosen V2. The people who remade it did a good job replicating the original, as well as making it sound better than before!<br><br><br><br>Q: What is your favorite part about development?<br><br>A: Definitely studying and learning from other musicians. There are a lot of people who specialize in different genres and it’s fun to study their music!<br><br><br><br>Q: Will there be anything related to AVA 9 or above?<br><br>A: Sadly not, since all of the songs in the mod are connected in some way. Adding the lore of AVA 9 and above would not work out with the story, so other than Victim’s songs, there won’t be any mentions of AVA 9+ in the mod. (sorry!)<br><br><br><br>Q: will hood irony be in the mod<br><br>A: yeah man<br><br><br><br>That’s all from me for now. I’ll post something else later on down the line, but until then, always pray to god and see you guys soon!"
    },
    {
        "id": 4,
        "title": "WELCOME TO THE WEBSITE",
        "writer": "kayla",
        "date": "2024/6/27",
        "content": "Hey everyone! This is our website! This is the main hub for stuff on the mod including this blog! Here you'll find posts written from our developers.<br><br>Gotta hand it to White Ninja for making this website. Bro cooked 🔥<br><br>Anyways uhhh.... Reply with questions about the mod! I'll be sure to answer as many as I can :3"
    },
    {
        "id": 5,
        "title": "POST-TRAILER BLOG/WHAT WE'VE BEEN UP TO",
        "writer": "kayla",
        "date": "2025/1/31",
        "content": "Hey, everyone! Been a while, huh. A while since we dropped a major teaser, since we used this website, a while since we've kept y'all posted, etc. Sorry about that… but we're back now & here to stay! You're probably here coming off the heels of the Ramware: BroadCast trailer. We're gonna go more in-detail on what you just saw, & more in this blog.<br><br>So before we do that, we should probably answer the question that's on a lot of y'all's minds….<br><br><h2>\"WHERE THE FUCK HAVE Y'ALL BEEN THESE PAST FEW MONTHS\"</h2><br><br>Well I feel like it's kinda time to explain that..Honestly, most of us have kinda been taking a break from AVFNF. We've been working really hard all this time & it's natural for us to wanna take a breather, because ultimately the team's mental health is the most important thing here, but fear not. Things are going to start picking up again soon & more teasers will be shown!!! We're coming back & we'll be here to stay unless said otherwise. That's not to say that NO progress has been made, obviously. I mean we're kinda showing it right now lol.<br><br>Anyways, on to the stuff you're probably reading this for.<br><br>TRAILER BREAKDOWN<br><br>We're gonna dive more in-detail on what you just saw from the trailer. Obviously we're not gonna break down EVERYTHING. That's the stuff y'all will have to do for yourselves 😉, but we are gonna break down the more major stuff that we want to draw attention towards.<br><br><h2>First off, THE FIVE WEEKS. WHAT ARE THEY?</h2><br><div class='blogimgg'><img src='images/blog/five.webp' id='blogimg'></div><br><br><br>The 5 weeks each cover different characters & stories from the Alan Becker universe. Each week has something different to offer character & music-wise. Here are some of the weeks you'll see while playing:<br><br><h2>MAIN WEEK - VS. THE STICK GANG</h2><br><div class='blogimgg'><img src='images/blog/stickgnag.webp' id='blogimg1'></div><br><br><br><br><br><br><br><br><br><br><br><br><br><br>A full remaster of Week 1! Face off against the stick gang a 2nd time with remastered music (besides Stick Symphony), remastered cutscenes, new sprites, & new mid-song events to discover!<br><br><h2>CHOSEN WEEK - VS. THE HOLLOWHEADS</h2><br><div class='blogimgg'><img src='images/blog/chosnen.webp' id='blogimg1'></div><br><br><br><br><br><br><br><br><br><br><br><br><br><br>Chosen, Vengeance & Fallen have all been combined into one week, all 3 of which getting remasters, with some new songs & cutscenes thrown in there too! Mechanics have also been improved to be less laggy & more fun!<br><br>(ps, we do have ava 11 content planned, but not for this update for a number of reasons. HOWEVER, we do have a plan to add ava 11 content in the future, keep victim's canon backstory intact while still keeping fallen the way it is.)<br><br><h2>KING ORANGE WEEK - AVM SEASON 3</h2><br><div class='blogimgg'><img src='images/blog/kingo.webp' id='blogimg1'></div><br><br><br><br><br><br><br><br><br><br><br><br><br><br>A retelling of Animation vs. Minecraft: Season 3 inside of FNF! The latter half of the King arc is being adapted in FNF form with all new music, sprites, cutscenes & mid-song events! You play as the Stick Gang + (plus some others characters) for the entirety of this week. No BF!! Each song will faithfully adapt its respective episode music & visual-wise.<br><br>As for the other 2 weeks, we'd like to keep those under wraps until release. All I'll say is this. None of the weeks have the same amount of songs. The biggest song count for a week is 11, while the smallest song count is 2. It's also important to mention that not every song will be in a week. Some of them are in Freeplay or need to be unlocked!<br><br>As to how you traverse these weeks, just keep reading to find out! It's REALLY cool….<br><br><h2>Onto the next part, THE MENUS.<br><br><div class='blogimgg'><img src='images/blog/free2play.gif' id='bloggif'></div><br><br><br><br><br><br><br><br><br></h2></h2><br><br>We decided to go back & remake all the menus to make them look more refined & modern-day! The freeplay menu is a lot more sleek, compact, and has been updated with new art & portraits made by The Deserved One! (side note but PLEASE go support deserved he’s crazy talented & has been CARRYING avfnf art-wise. pls show him lots of love!)<br><br>The main menu has also gotten an update! This time with new buttons, a darker background, a generally more sleek look & new artwork!<br><br><div class='blogimgg'><img src='images/blog/sotry mawd.webp' id='blogimg2'></div><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>On top of that, we've even given a brand-new look to the pause menu by giving each song its own character portrait and making the menu match their color! We’ve also added a new theme to go along with it!<br><br><div class='blogimgg'><img src='images/blog/paws enu.webp' id='blogimg2'></div><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><h2>Introducing… THE OVERWORLD<br>(Coded & sprited by Claire)<br><br><div class='blogimgg'><img src='images/blog/ovrwrld.gif' id='bloggif'></div><br><br><br><br><br><br><br><br><br></h2><br><br>The overworld will function as the story menu for the mod! It'll be the way you traverse through the different weeks in AVFNF! The landmarks you see in the GIF (the couch & the nether portal), will be the ways you enter the Stick Gang & King Orange weeks respectively! (The one for Chosen week is also there, it's just offscreen).<br><br>It needs to be said that the footage you see above is VERY early in development & was put together just so we could show it in the trailer. The plan is for you to have to jump, climb, & platform your way to each landmark, & unlock them as you play the mod! If you've played Sonic Generations, it’s kinda like the hub world from that. (obviously smaller tho.)<br><br><h2>CLOSING WORDS</h2><br><br>Thank you for your support over these past 2 years. We know it's taken a REALLY long time, but we appreciate your patience so, so much. It means the world to us. We also hope you enjoyed the trailer! We all worked really hard on it,,, we hope you enjoyed it & this blog if you’re a longtime fan, & if you're a new fan, Hi!!! Hello!!!! Welcome!!!!!! ^_^ We hope you enjoyed what you've seen, & we hope you're hyped for the release. I can't see the mod NOT dropping this year tbh. I can see the light at the end of the tunnel. It might not be very close, but it damn sure is there. This mod will NOT disappoint. Thanks for reading, watching, & have a lovely day!!<br><br>-Kayla"
    }
]